[Killed] LogicalOperator
app/routes/auth/token.utils.ts:4:30
 import * as jwt from 'jsonwebtoken';
 
 const generateToken = (id: number): string =>
-  jwt.sign({ user: { id } }, process.env.JWT_SECRET || 'superSecret', {
+  jwt.sign({ user: { id } }, process.env.JWT_SECRET && 'superSecret', {
     expiresIn: '60d',
   });
killedBy: AuthService createUser should create new user and return a token
statusReason: Error: expect(received).resolves.toHaveProperty()

Received promise rejected instead of resolved
Rejected to value: [Error: secretOrPrivateKey must have a value]
