[Killed] ArrowFunction
app/routes/article/article.mapper.ts:8:32
   title: article.title,
   description: article.description,
   body: article.body,
-  tagList: article.tagList.map((tag: any) => tag.name),
+  tagList: article.tagList.map(() => undefined),
   createdAt: article.createdAt,
   updatedAt: article.updatedAt,
killedBy: ArticleService getArticles should map articles using articleMapper (tagList as string array)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "test",
+   undefined,

[Killed] EqualityOperator
app/routes/article/article.mapper.ts:11:54
   tagList: article.tagList.map((tag: any) => tag.name),
   createdAt: article.createdAt,
   updatedAt: article.updatedAt,
-  favorited: article.favoritedBy.some((item: any) => item.id === id),
+  favorited: article.favoritedBy.some((item: any) => item.id !== id),
   favoritesCount: article.favoritedBy.length,
   author: authorMapper(article.author, id),
killedBy: articleMapper should return favorited: true when user has favorited the article
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
app/routes/article/article.mapper.ts:11:54
   tagList: article.tagList.map((tag: any) => tag.name),
   createdAt: article.createdAt,
   updatedAt: article.updatedAt,
-  favorited: article.favoritedBy.some((item: any) => item.id === id),
+  favorited: article.favoritedBy.some((item: any) => false),
   favoritesCount: article.favoritedBy.length,
   author: authorMapper(article.author, id),
killedBy: ArticleService getArticles should return favorited:true when user id is in favoritedBy
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
