[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:20:12
   });
 
   const existingUserByUsername = await prisma.user.findUnique({
-    where: {
-      username,
-    },
+    where: {},
     select: {
       id: true,
killedBy: AuthService createUser should call findUnique with email then with username for uniqueness check
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: ObjectContaining {"select": {"id": true}, "where": {"username": "RW"}}
Received
       1: {"select": {"id": true}, "where": {"email": "rw@me"}}
->     2: {"select": {"id": true}, "where": {}}

[Killed] ConditionalExpression
app/routes/auth/auth.service.ts:28:7
     },
   });
 
-  if (existingUserByEmail || existingUserByUsername) {
+  if (false) {
     throw new HttpException(422, {
       errors: {
killedBy: AuthService createUser should throw error with email field only when only email is taken
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": ObjectContaining {
-     "errors": ObjectContaining {

[Killed] BlockStatement
app/routes/auth/auth.service.ts:28:54
     },
   });
 
-  if (existingUserByEmail || existingUserByUsername) {
-    throw new HttpException(422, {
-      errors: {
-        ...(existingUserByEmail ? { email: ['has already been taken'] } : {}),
-        ...(existingUserByUsername ? { username: ['has already been taken'] } : {}),
-      },
-    });
-  }
+  if (existingUserByEmail || existingUserByUsername) {}
 };
 
killedBy: AuthService createUser should throw error with email field only when only email is taken
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": ObjectContaining {
-     "errors": ObjectContaining {

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:29:34
   });
 
   if (existingUserByEmail || existingUserByUsername) {
-    throw new HttpException(422, {
-      errors: {
-        ...(existingUserByEmail ? { email: ['has already been taken'] } : {}),
-        ...(existingUserByUsername ? { username: ['has already been taken'] } : {}),
-      },
-    });
+    throw new HttpException(422, {});
   }
 };
killedBy: AuthService createUser should throw error with email field only when only email is taken
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": ObjectContaining {
-     "errors": ObjectContaining {

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:31:35
   if (existingUserByEmail || existingUserByUsername) {
     throw new HttpException(422, {
       errors: {
-        ...(existingUserByEmail ? { email: ['has already been taken'] } : {}),
+        ...(existingUserByEmail ? {} : {}),
         ...(existingUserByUsername ? { username: ['has already been taken'] } : {}),
       },
killedBy: AuthService createUser should throw error with email field only when only email is taken
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": ObjectContaining {
-     "errors": ObjectContaining {

[Killed] StringLiteral
app/routes/auth/auth.service.ts:31:45
   if (existingUserByEmail || existingUserByUsername) {
     throw new HttpException(422, {
       errors: {
-        ...(existingUserByEmail ? { email: ['has already been taken'] } : {}),
+        ...(existingUserByEmail ? { email: [""] } : {}),
         ...(existingUserByUsername ? { username: ['has already been taken'] } : {}),
       },
killedBy: AuthService createUser should throw error with email field only when only email is taken
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": ObjectContaining {
-     "errors": ObjectContaining {

[Killed] StringLiteral
app/routes/auth/auth.service.ts:32:51
     throw new HttpException(422, {
       errors: {
         ...(existingUserByEmail ? { email: ['has already been taken'] } : {}),
-        ...(existingUserByUsername ? { username: ['has already been taken'] } : {}),
+        ...(existingUserByUsername ? { username: [""] } : {}),
       },
     });
killedBy: AuthService createUser should throw error with username field only when only username is taken
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": ObjectContaining {
-     "errors": ObjectContaining {

[Killed] MethodExpression
app/routes/auth/auth.service.ts:39:17
 };
 
 export const createUser = async (input: RegisterInput): Promise<RegisteredUser> => {
-  const email = input.email?.trim();
+  const email = input.email;
   const username = input.username?.trim();
   const password = input.password?.trim();
killedBy: AuthService createUser should throw 422 with email error when email is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] OptionalChaining
app/routes/auth/auth.service.ts:39:17
 };
 
 export const createUser = async (input: RegisterInput): Promise<RegisteredUser> => {
-  const email = input.email?.trim();
+  const email = input.email.trim();
   const username = input.username?.trim();
   const password = input.password?.trim();
killedBy: AuthService createUser should throw 422 with email error when email is undefined
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] OptionalChaining
app/routes/auth/auth.service.ts:40:20
 
 export const createUser = async (input: RegisterInput): Promise<RegisteredUser> => {
   const email = input.email?.trim();
-  const username = input.username?.trim();
+  const username = input.username.trim();
   const password = input.password?.trim();
   const { image, bio, demo } = input;
killedBy: AuthService createUser should throw 422 with username error when username is undefined
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] MethodExpression
app/routes/auth/auth.service.ts:40:20
 
 export const createUser = async (input: RegisterInput): Promise<RegisteredUser> => {
   const email = input.email?.trim();
-  const username = input.username?.trim();
+  const username = input.username;
   const password = input.password?.trim();
   const { image, bio, demo } = input;
killedBy: AuthService createUser should throw 422 with username error when username is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] OptionalChaining
app/routes/auth/auth.service.ts:41:20
 export const createUser = async (input: RegisterInput): Promise<RegisteredUser> => {
   const email = input.email?.trim();
   const username = input.username?.trim();
-  const password = input.password?.trim();
+  const password = input.password.trim();
   const { image, bio, demo } = input;
 
killedBy: AuthService createUser should throw 422 with password error when password is undefined
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] MethodExpression
app/routes/auth/auth.service.ts:41:20
 export const createUser = async (input: RegisterInput): Promise<RegisteredUser> => {
   const email = input.email?.trim();
   const username = input.username?.trim();
-  const password = input.password?.trim();
+  const password = input.password;
   const { image, bio, demo } = input;
 
killedBy: AuthService createUser should throw 422 with password error when password is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] StringLiteral
app/routes/auth/auth.service.ts:45:54
   const { image, bio, demo } = input;
 
   if (!email) {
-    throw new HttpException(422, { errors: { email: ["can't be blank"] } });
+    throw new HttpException(422, { errors: { email: [""] } });
   }
 
killedBy: AuthService createUser should throw 422 with email error when email is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 7
+ Received  + 0

  Object {
    "errorCode": 422,
-   "message": Object {

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:49:44
   }
 
   if (!username) {
-    throw new HttpException(422, { errors: { username: ["can't be blank"] } });
+    throw new HttpException(422, { errors: {} });
   }
 
killedBy: AuthService createUser should throw 422 with username error when username is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 7
+ Received  + 0

  Object {
    "errorCode": 422,
-   "message": Object {

[Killed] ArrayDeclaration
app/routes/auth/auth.service.ts:49:56
   }
 
   if (!username) {
-    throw new HttpException(422, { errors: { username: ["can't be blank"] } });
+    throw new HttpException(422, { errors: { username: [] } });
   }
 
killedBy: AuthService createUser should throw 422 with username error when username is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 7
+ Received  + 0

  Object {
    "errorCode": 422,
-   "message": Object {

[Killed] StringLiteral
app/routes/auth/auth.service.ts:53:57
   }
 
   if (!password) {
-    throw new HttpException(422, { errors: { password: ["can't be blank"] } });
+    throw new HttpException(422, { errors: { password: [""] } });
   }
 
killedBy: AuthService createUser should throw 422 with password error when password is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 7
+ Received  + 0

  Object {
    "errorCode": 422,
-   "message": Object {

[Killed] ArrayDeclaration
app/routes/auth/auth.service.ts:53:56
   }
 
   if (!password) {
-    throw new HttpException(422, { errors: { password: ["can't be blank"] } });
+    throw new HttpException(422, { errors: { password: [] } });
   }
 
killedBy: AuthService createUser should throw 422 with password error when password is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 7
+ Received  + 0

  Object {
    "errorCode": 422,
-   "message": Object {

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:67:18
       password: hashedPassword,
       ...(image ? { image } : {}),
       ...(bio ? { bio } : {}),
-      ...(demo ? { demo } : {}),
+      ...(demo ? {} : {}),
     },
     select: {
killedBy: AuthService createUser should create user with demo flag when demo is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] MethodExpression
app/routes/auth/auth.service.ts:85:17
 };
 
 export const login = async (userPayload: any) => {
-  const email = userPayload.email?.trim();
+  const email = userPayload.email;
   const password = userPayload.password?.trim();
 
killedBy: AuthService login should throw 422 with email error when email is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 8
+ Received  + 1

  Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] OptionalChaining
app/routes/auth/auth.service.ts:85:17
 };
 
 export const login = async (userPayload: any) => {
-  const email = userPayload.email?.trim();
+  const email = userPayload.email.trim();
   const password = userPayload.password?.trim();
 
killedBy: AuthService login should throw 422 with email error when email is undefined
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] MethodExpression
app/routes/auth/auth.service.ts:86:20
 
 export const login = async (userPayload: any) => {
   const email = userPayload.email?.trim();
-  const password = userPayload.password?.trim();
+  const password = userPayload.password;
 
   if (!email) {
killedBy: AuthService login should throw 422 with password error when password is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 8
+ Received  + 1

  Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] OptionalChaining
app/routes/auth/auth.service.ts:86:20
 
 export const login = async (userPayload: any) => {
   const email = userPayload.email?.trim();
-  const password = userPayload.password?.trim();
+  const password = userPayload.password.trim();
 
   if (!email) {
killedBy: AuthService login should throw 422 with password error when password is undefined
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] BlockStatement
app/routes/auth/auth.service.ts:88:15
   const email = userPayload.email?.trim();
   const password = userPayload.password?.trim();
 
-  if (!email) {
-    throw new HttpException(422, { errors: { email: ["can't be blank"] } });
-  }
+  if (!email) {}
 
   if (!password) {
killedBy: AuthService login should throw 422 with email error when email is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 8
+ Received  + 1

  Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] ConditionalExpression
app/routes/auth/auth.service.ts:88:7
   const email = userPayload.email?.trim();
   const password = userPayload.password?.trim();
 
-  if (!email) {
+  if (true) {
     throw new HttpException(422, { errors: { email: ["can't be blank"] } });
   }
killedBy: AuthService login should return a token on successful login
statusReason: Error: [object Object]

[Killed] ConditionalExpression
app/routes/auth/auth.service.ts:92:7
     throw new HttpException(422, { errors: { email: ["can't be blank"] } });
   }
 
-  if (!password) {
+  if (false) {
     throw new HttpException(422, { errors: { password: ["can't be blank"] } });
   }
killedBy: AuthService login should throw 422 with password error when password is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 8
+ Received  + 1

  Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:93:34
   }
 
   if (!password) {
-    throw new HttpException(422, { errors: { password: ["can't be blank"] } });
+    throw new HttpException(422, {});
   }
 
killedBy: AuthService login should throw 422 with password error when password is blank
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 7
+ Received  + 0

  Object {
    "errorCode": 422,
-   "message": Object {

[Killed] BlockStatement
app/routes/auth/auth.service.ts:110:13
     },
   });
 
-  if (user) {
-    const match = await bcrypt.compare(password, user.password);
-
-    if (match) {
-      return {
-        email: user.email,
-        username: user.username,
-        bio: user.bio,
-        image: user.image,
-        token: generateToken(user.id),
-      };
-    }
-  }
+  if (user) {}
 
   throw new HttpException(403, {
killedBy: AuthService login should return a token on successful login
statusReason: Error: [object Object]

[Killed] BlockStatement
app/routes/auth/auth.service.ts:113:16
   if (user) {
     const match = await bcrypt.compare(password, user.password);
 
-    if (match) {
-      return {
-        email: user.email,
-        username: user.username,
-        bio: user.bio,
-        image: user.image,
-        token: generateToken(user.id),
-      };
-    }
+    if (match) {}
   }
 
killedBy: AuthService login should return a token on successful login
statusReason: Error: [object Object]

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:124:32
     }
   }
 
-  throw new HttpException(403, {
-    errors: {
-      'email or password': ['is invalid'],
-    },
-  });
+  throw new HttpException(403, {});
 };
 
killedBy: AuthService login should throw with invalid credentials error when user is not found
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ArrayDeclaration
app/routes/auth/auth.service.ts:126:28
 
   throw new HttpException(403, {
     errors: {
-      'email or password': ['is invalid'],
+      'email or password': [],
     },
   });
killedBy: AuthService login should throw with invalid credentials error when user is not found
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] BlockStatement
app/routes/auth/auth.service.ts:131:53
   });
 };
 
-export const getCurrentUser = async (id: number) => {
-  const user = (await prisma.user.findUnique({
-    where: {
-      id,
-    },
-    select: {
-      id: true,
-      email: true,
-      username: true,
-      bio: true,
-      image: true,
-    },
-  })) as User;
-
-  return {
-    ...user,
-    token: generateToken(user.id),
-  };
-};
+export const getCurrentUser = async (id: number) => {};
 
 export const updateUser = async (userPayload: any, id: number) => {
killedBy: AuthService getCurrentUser should return a user with a token
statusReason: Error: expect(received).resolves.toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:145:10
     },
   })) as User;
 
-  return {
-    ...user,
-    token: generateToken(user.id),
-  };
+  return {};
 };
 
killedBy: AuthService getCurrentUser should return a user with a token
statusReason: Error: expect(received).resolves.toHaveProperty(path)

Expected path: "token"
Received path: []

Received value: {}

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:160:12
   }
 
   const user = await prisma.user.update({
-    where: {
-      id: id,
-    },
+    where: {},
     data: {
       ...(email ? { email } : {}),
killedBy: AuthService updateUser should call user.update with correct id and select
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"select": {"bio": true, "email": true, "id": true, "image": true, "username": true}, "where": {"id": 123}}
Received: {"data": {"email": "rw@me"}, "select": {"bio": true, "email": true, "id": true, "image": true, "username": true}, "where": {}}

Number of calls: 1

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:166:22
     data: {
       ...(email ? { email } : {}),
       ...(username ? { username } : {}),
-      ...(password ? { password: hashedPassword } : {}),
+      ...(password ? {} : {}),
       ...(image ? { image } : {}),
       ...(bio ? { bio } : {}),
killedBy: AuthService updateUser should store a bcrypt hash (not plaintext) in update data when password is provided
statusReason: Error: Illegal arguments: string, undefined

[Killed] ObjectLiteral
app/routes/auth/auth.service.ts:167:19
       ...(email ? { email } : {}),
       ...(username ? { username } : {}),
       ...(password ? { password: hashedPassword } : {}),
-      ...(image ? { image } : {}),
+      ...(image ? {} : {}),
       ...(bio ? { bio } : {}),
     },
killedBy: AuthService updateUser should include image in update data when image is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "new.png"
Received: undefined

[Killed] BooleanLiteral
app/routes/auth/auth.service.ts:173:17
     select: {
       id: true,
       email: true,
-      username: true,
+      username: false,
       bio: true,
       image: true,
killedBy: AuthService updateUser should call user.update with correct id and select
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"select": {"bio": true, "email": true, "id": true, "image": true, "username": true}, "where": {"id": 123}}
Received: {"data": {"email": "rw@me"}, "select": {"bio": true, "email": true, "id": true, "image": true, "username": false}, "where": {"id": 123}}

Number of calls: 1
