[Killed] ConditionalExpression
app/routes/profile/profile.utils.ts:9:62
   bio: user.bio,
   image: user.image,
   following: id
-    ? user.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? user.followedBy.some((followingUser: Partial<User>) => false)
     : false,
 });
killedBy: ProfileService getProfile should return following:true when viewer IS in followedBy
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "following"

Expected value: true
Received value: false

[Killed] ConditionalExpression
app/routes/profile/profile.utils.ts:9:62
   bio: user.bio,
   image: user.image,
   following: id
-    ? user.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? user.followedBy.some((followingUser: Partial<User>) => true)
     : false,
 });
killedBy: ProfileUtils profileMapper should return a profile not followed by the user
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bio": "My happy life",
-   "following": false,

[Killed] BooleanLiteral
app/routes/profile/profile.utils.ts:10:7
   image: user.image,
   following: id
     ? user.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
-    : false,
+    : true,
 });
 
killedBy: ProfileService getProfile should return following:false when id is undefined
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "following"

Expected value: false
Received value: true
