[Killed] ArrayDeclaration
app/routes/article/article.service.ts:9:24
 import { Tag } from '../tag/tag.model';
 
 const buildFindAllQuery = (query: any, id: number | undefined) => {
-  const queries: any = [];
+  const queries: any = ["Stryker was here"];
   const orAuthorQuery = [];
   const andAuthorQuery = [];
killedBy: ArticleService getArticles should include demo:true in author OR query
statusReason: TypeError: Cannot read properties of undefined (reading 'OR')

[Killed] ObjectLiteral
app/routes/article/article.service.ts:13:22
   const orAuthorQuery = [];
   const andAuthorQuery = [];
 
-  orAuthorQuery.push({
-    demo: {
-      equals: true,
-    },
-  });
+  orAuthorQuery.push({});
 
   if (id) {
killedBy: ArticleService getArticles should include demo:true in author OR query
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"demo": {"equals": true}}
Received array: [{}]

[Killed] BooleanLiteral
app/routes/article/article.service.ts:15:15
 
   orAuthorQuery.push({
     demo: {
-      equals: true,
+      equals: false,
     },
   });
killedBy: ArticleService getArticles should include demo:true in author OR query
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"demo": {"equals": true}}
Received array: [{"demo": {"equals": false}}]

[Killed] ConditionalExpression
app/routes/article/article.service.ts:19:7
     },
   });
 
-  if (id) {
+  if (true) {
     orAuthorQuery.push({
       id: {
killedBy: ArticleService getArticles should NOT include id in OR query when no id provided
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"demo": {"equals": true}}, {"id": {"equals": undefined}}]

[Killed] BlockStatement
app/routes/article/article.service.ts:19:11
     },
   });
 
-  if (id) {
-    orAuthorQuery.push({
-      id: {
-        equals: id,
-      },
-    });
-  }
+  if (id) {}
 
   if ('author' in query) {
killedBy: ArticleService getArticles should include user id in OR query when id is provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"id": {"equals": 5}}
Received array: [{"demo": {"equals": true}}]

[Killed] ObjectLiteral
app/routes/article/article.service.ts:20:24
   });
 
   if (id) {
-    orAuthorQuery.push({
-      id: {
-        equals: id,
-      },
-    });
+    orAuthorQuery.push({});
   }
 
killedBy: ArticleService getArticles should include user id in OR query when id is provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"id": {"equals": 5}}
Received array: [{"demo": {"equals": true}}, {}]

[Killed] ObjectLiteral
app/routes/article/article.service.ts:21:11
 
   if (id) {
     orAuthorQuery.push({
-      id: {
-        equals: id,
-      },
+      id: {},
     });
   }
killedBy: ArticleService getArticles should include user id in OR query when id is provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"id": {"equals": 5}}
Received array: [{"demo": {"equals": true}}, {"id": {}}]

[Killed] BlockStatement
app/routes/article/article.service.ts:27:26
     });
   }
 
-  if ('author' in query) {
-    andAuthorQuery.push({
-      username: {
-        equals: query.author,
-      },
-    });
-  }
+  if ('author' in query) {}
 
   const authorQuery = {
killedBy: ArticleService getArticles should include author filter in AND query when author param is given
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"username": {"equals": "TestUser"}}
Received array: []

[Killed] ConditionalExpression
app/routes/article/article.service.ts:27:7
     });
   }
 
-  if ('author' in query) {
+  if (true) {
     andAuthorQuery.push({
       username: {
killedBy: ArticleService getArticles should have empty andAuthorQuery when author is not in query
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 7

- Array []
+ Array [
+   Object {

[Killed] ObjectLiteral
app/routes/article/article.service.ts:29:17
 
   if ('author' in query) {
     andAuthorQuery.push({
-      username: {
-        equals: query.author,
-      },
+      username: {},
     });
   }
killedBy: ArticleService getArticles should include author filter in AND query when author param is given
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"username": {"equals": "TestUser"}}
Received array: [{"username": {}}]

[Killed] BlockStatement
app/routes/article/article.service.ts:44:23
 
   queries.push(authorQuery);
 
-  if ('tag' in query) {
-    queries.push({
-      tagList: {
-        some: {
-          name: query.tag,
-        },
-      },
-    });
-  }
+  if ('tag' in query) {}
 
   if ('favorited' in query) {
killedBy: ArticleService getArticles should include tag filter in AND queries when tag param is given
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"tagList": {"some": {"name": "react"}}}
Received array: [{"author": {"AND": [], "OR": [{"demo": {"equals": true}}]}}]

[Killed] ConditionalExpression
app/routes/article/article.service.ts:44:7
 
   queries.push(authorQuery);
 
-  if ('tag' in query) {
+  if (true) {
     queries.push({
       tagList: {
killedBy: ArticleService getArticles should not include tag filter when tag is not in query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ObjectLiteral
app/routes/article/article.service.ts:45:18
   queries.push(authorQuery);
 
   if ('tag' in query) {
-    queries.push({
-      tagList: {
-        some: {
-          name: query.tag,
-        },
-      },
-    });
+    queries.push({});
   }
 
killedBy: ArticleService getArticles should include tag filter in AND queries when tag param is given
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"tagList": {"some": {"name": "react"}}}
Received array: [{"author": {"AND": [], "OR": [{"demo": {"equals": true}}]}}, {}]

[Killed] ObjectLiteral
app/routes/article/article.service.ts:47:15
   if ('tag' in query) {
     queries.push({
       tagList: {
-        some: {
-          name: query.tag,
-        },
+        some: {},
       },
     });
killedBy: ArticleService getArticles should include tag filter in AND queries when tag param is given
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"tagList": {"some": {"name": "react"}}}
Received array: [{"author": {"AND": [], "OR": [{"demo": {"equals": true}}]}}, {"tagList": {"some": {}}}]

[Killed] ConditionalExpression
app/routes/article/article.service.ts:54:7
     });
   }
 
-  if ('favorited' in query) {
+  if (true) {
     queries.push({
       favoritedBy: {
killedBy: ArticleService getArticles should not include favorited filter when favorited is not in query
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
app/routes/article/article.service.ts:54:7
     });
   }
 
-  if ('favorited' in query) {
+  if (false) {
     queries.push({
       favoritedBy: {
killedBy: ArticleService getArticles should include favorited filter in AND queries when favorited param is given
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"favoritedBy": {"some": {"username": {"equals": "SomeUser"}}}}
Received array: [{"author": {"AND": [], "OR": [{"demo": {"equals": true}}]}}]

[Killed] ObjectLiteral
app/routes/article/article.service.ts:71:52
 
 export const getArticles = async (query: any, id?: number) => {
   const andQueries = buildFindAllQuery(query, id);
-  const articlesCount = await prisma.article.count({
-    where: {
-      AND: andQueries,
-    },
-  });
+  const articlesCount = await prisma.article.count({});
 
   const articles = await prisma.article.findMany({
killedBy: ArticleService getArticles should call count and findMany with AND where clause
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
app/routes/article/article.service.ts:78:12
   });
 
   const articles = await prisma.article.findMany({
-    where: { AND: andQueries },
+    where: {},
     orderBy: {
       createdAt: 'desc',
killedBy: ArticleService getArticles should call count and findMany with AND where clause
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "AND"
Received path: []

Received value: {}

[Killed] LogicalOperator
app/routes/article/article.service.ts:82:11
     orderBy: {
       createdAt: 'desc',
     },
-    skip: Number(query.offset) || 0,
+    skip: Number(query.offset) && 0,
     take: Number(query.limit) || 10,
     include: {
killedBy: ArticleService getArticles should use skip=0 and take=10 by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] LogicalOperator
app/routes/article/article.service.ts:83:11
       createdAt: 'desc',
     },
     skip: Number(query.offset) || 0,
-    take: Number(query.limit) || 10,
+    take: Number(query.limit) && 10,
     include: {
       tagList: {
killedBy: ArticleService getArticles should use skip=0 and take=10 by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: NaN

[Killed] BooleanLiteral
app/routes/article/article.service.ts:87:17
     include: {
       tagList: {
         select: {
-          name: true,
+          name: false,
         },
       },
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -13,9 +13,9 @@
      },
    },

[Killed] BooleanLiteral
app/routes/article/article.service.ts:92:21
       },
       author: {
         select: {
-          username: true,
+          username: false,
           bio: true,
           image: true,
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
    "author": Object {
      "select": Object {

[Killed] BooleanLiteral
app/routes/article/article.service.ts:93:16
       author: {
         select: {
           username: true,
-          bio: true,
+          bio: false,
           image: true,
           followedBy: true,
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -4,11 +4,11 @@
        "favoritedBy": true,
      },

[Killed] BooleanLiteral
app/routes/article/article.service.ts:94:18
         select: {
           username: true,
           bio: true,
-          image: true,
+          image: false,
           followedBy: true,
         },
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
    },
    "author": Object {

[Killed] BooleanLiteral
app/routes/article/article.service.ts:95:23
           username: true,
           bio: true,
           image: true,
-          followedBy: true,
+          followedBy: false,
         },
       },
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
      },
    },

[Killed] BooleanLiteral
app/routes/article/article.service.ts:98:20
           followedBy: true,
         },
       },
-      favoritedBy: true,
+      favoritedBy: false,
       _count: {
         select: {
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -10,11 +10,11 @@
        "followedBy": true,
        "image": true,

[Killed] ObjectLiteral
app/routes/article/article.service.ts:100:17
       },
       favoritedBy: true,
       _count: {
-        select: {
-          favoritedBy: true,
-        },
+        select: {},
       },
     },
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

@@ -1,10 +1,8 @@
  Object {
    "_count": Object {

[Killed] BooleanLiteral
app/routes/article/article.service.ts:101:24
       favoritedBy: true,
       _count: {
         select: {
-          favoritedBy: true,
+          favoritedBy: false,
         },
       },
killedBy: ArticleService getArticles should use exact include structure for findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  Object {
    "_count": Object {

[Killed] ArrowFunction
app/routes/article/article.service.ts:108:28
   });
 
   return {
-    articles: articles.map((article: any) => articleMapper(article, id)),
+    articles: articles.map(() => undefined),
     articlesCount,
   };
killedBy: ArticleService getArticles should map articles using articleMapper (tagList as string array)
statusReason: TypeError: Cannot read properties of undefined (reading 'tagList')

[Killed] LogicalOperator
app/routes/article/article.service.ts:131:11
     orderBy: {
       createdAt: 'desc',
     },
-    skip: offset || 0,
+    skip: offset && 0,
     take: limit || 10,
     include: {
killedBy: ArticleService getFeed should apply skip and take for feed pagination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] LogicalOperator
app/routes/article/article.service.ts:132:11
       createdAt: 'desc',
     },
     skip: offset || 0,
-    take: limit || 10,
+    take: limit && 10,
     include: {
       tagList: {
killedBy: ArticleService getFeed should apply skip and take for feed pagination
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 10

[Killed] ObjectLiteral
app/routes/article/article.service.ts:135:17
     take: limit || 10,
     include: {
       tagList: {
-        select: {
-          name: true,
-        },
+        select: {},
       },
       author: {
killedBy: ArticleService getFeed should use exact include structure for feed findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

@@ -12,10 +12,8 @@
        "username": true,
      },

[Killed] ObjectLiteral
app/routes/article/article.service.ts:140:17
         },
       },
       author: {
-        select: {
-          username: true,
-          bio: true,
-          image: true,
-          followedBy: true,
-        },
+        select: {},
       },
       favoritedBy: true,
killedBy: ArticleService getFeed should use exact include structure for feed findMany
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

@@ -3,16 +3,11 @@
      "select": Object {
        "favoritedBy": true,

[Killed] BooleanLiteral
app/routes/article/article.service.ts:166:7
   const { title, description, body, tagList } = article;
   const tags = Array.isArray(tagList) ? tagList : [];
 
-  if (!title) {
+  if (title) {
     throw new HttpException(422, { errors: { title: ["can't be blank"] } });
   }
killedBy: ArticleService createArticle should throw with title error when title is missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] BlockStatement
app/routes/article/article.service.ts:166:15
   const { title, description, body, tagList } = article;
   const tags = Array.isArray(tagList) ? tagList : [];
 
-  if (!title) {
-    throw new HttpException(422, { errors: { title: ["can't be blank"] } });
-  }
+  if (!title) {}
 
   if (!description) {
killedBy: ArticleService createArticle should throw with title error when title is missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ArrayDeclaration
app/routes/article/article.service.ts:167:53
   const tags = Array.isArray(tagList) ? tagList : [];
 
   if (!title) {
-    throw new HttpException(422, { errors: { title: ["can't be blank"] } });
+    throw new HttpException(422, { errors: { title: [] } });
   }
 
killedBy: ArticleService createArticle should throw with title error when title is missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ConditionalExpression
app/routes/article/article.service.ts:170:7
     throw new HttpException(422, { errors: { title: ["can't be blank"] } });
   }
 
-  if (!description) {
+  if (true) {
     throw new HttpException(422, { errors: { description: ["can't be blank"] } });
   }
killedBy: ArticleService createArticle should throw with body error when body is missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ConditionalExpression
app/routes/article/article.service.ts:170:7
     throw new HttpException(422, { errors: { title: ["can't be blank"] } });
   }
 
-  if (!description) {
+  if (false) {
     throw new HttpException(422, { errors: { description: ["can't be blank"] } });
   }
killedBy: ArticleService createArticle should throw with description error when description is missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] BlockStatement
app/routes/article/article.service.ts:174:14
     throw new HttpException(422, { errors: { description: ["can't be blank"] } });
   }
 
-  if (!body) {
-    throw new HttpException(422, { errors: { body: ["can't be blank"] } });
-  }
+  if (!body) {}
 
   const slug = `${slugify(title)}-${id}`;
killedBy: ArticleService createArticle should throw with body error when body is missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ArrayDeclaration
app/routes/article/article.service.ts:175:52
   }
 
   if (!body) {
-    throw new HttpException(422, { errors: { body: ["can't be blank"] } });
+    throw new HttpException(422, { errors: { body: [] } });
   }
 
killedBy: ArticleService createArticle should throw with body error when body is missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] StringLiteral
app/routes/article/article.service.ts:178:16
     throw new HttpException(422, { errors: { body: ["can't be blank"] } });
   }
 
-  const slug = `${slugify(title)}-${id}`;
+  const slug = ``;
 
   const existingTitle = await prisma.article.findUnique({
killedBy: ArticleService createArticle should check for slug uniqueness using slugify(title)-id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"slug": "My-Title-42"}}
Received: {"select": {"slug": true}, "where": {"slug": ""}}

Number of calls: 1

[Killed] ObjectLiteral
app/routes/article/article.service.ts:181:12
   const slug = `${slugify(title)}-${id}`;
 
   const existingTitle = await prisma.article.findUnique({
-    where: {
-      slug,
-    },
+    where: {},
     select: {
       slug: true,
killedBy: ArticleService createArticle should check for slug uniqueness using slugify(title)-id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"slug": "My-Title-42"}}
Received: {"select": {"slug": true}, "where": {}}

Number of calls: 1

[Killed] BooleanLiteral
app/routes/article/article.service.ts:185:13
       slug,
     },
     select: {
-      slug: true,
+      slug: false,
     },
   });
killedBy: ArticleService createArticle should call findUnique with select:{slug:true} for uniqueness check
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "slug": true,
+   "slug": false,

[Killed] ConditionalExpression
app/routes/article/article.service.ts:189:7
     },
   });
 
-  if (existingTitle) {
+  if (false) {
     throw new HttpException(422, { errors: { title: ['must be unique'] } });
   }
killedBy: ArticleService createArticle should throw with unique title error when slug already exists
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] BlockStatement
app/routes/article/article.service.ts:189:22
     },
   });
 
-  if (existingTitle) {
-    throw new HttpException(422, { errors: { title: ['must be unique'] } });
-  }
+  if (existingTitle) {}
 
   const {
killedBy: ArticleService createArticle should throw with unique title error when slug already exists
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ArrayDeclaration
app/routes/article/article.service.ts:190:53
   });
 
   if (existingTitle) {
-    throw new HttpException(422, { errors: { title: ['must be unique'] } });
+    throw new HttpException(422, { errors: { title: [] } });
   }
 
killedBy: ArticleService createArticle should throw with unique title error when slug already exists
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ObjectLiteral
app/routes/article/article.service.ts:190:44
   });
 
   if (existingTitle) {
-    throw new HttpException(422, { errors: { title: ['must be unique'] } });
+    throw new HttpException(422, { errors: {} });
   }
 
killedBy: ArticleService createArticle should throw with unique title error when slug already exists
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ArrowFunction
app/routes/article/article.service.ts:204:35
       body,
       slug,
       tagList: {
-        connectOrCreate: tags.map((tag: string) => ({
-          create: { name: tag },
-          where: { name: tag },
-        })),
+        connectOrCreate: tags.map(() => undefined),
       },
       author: {
killedBy: ArticleService createArticle should use connectOrCreate with tags when tagList is an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"create": {"name": "tag1"}, "where": {"name": "tag1"}}
Received: undefined

[Killed] ObjectLiteral
app/routes/article/article.service.ts:230:15
         },
       },
       favoritedBy: true,
-      _count: {
-        select: {
-          favoritedBy: true,
-        },
-      },
+      _count: {},
     },
   });
killedBy: ArticleService createArticle should use exact include structure for article.create
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

@@ -1,11 +1,7 @@
  Object {
-   "_count": Object {

[Killed] ObjectLiteral
app/routes/article/article.service.ts:247:16
       slug,
     },
     include: {
-      tagList: {
-        select: {
-          name: true,
-        },
-      },
+      tagList: {},
       author: {
         select: {
killedBy: ArticleService getArticle should use exact include structure for getArticle findUnique
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

@@ -11,11 +11,7 @@
        "image": true,
        "username": true,

[Killed] ConditionalExpression
app/routes/article/article.service.ts:269:7
     },
   });
 
-  if (!article) {
+  if (false) {
     throw new HttpException(404, { errors: { article: ['not found'] } });
   }
killedBy: ArticleService getArticle should throw 404 with exact error structure when article not found
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 404,
-   "message": Object {

[Killed] BooleanLiteral
app/routes/article/article.service.ts:269:7
     },
   });
 
-  if (!article) {
+  if (article) {
     throw new HttpException(404, { errors: { article: ['not found'] } });
   }
killedBy: ArticleService getArticle should return article when found
statusReason: Error: [object Object]

[Killed] ArrayDeclaration
app/routes/article/article.service.ts:270:55
   });
 
   if (!article) {
-    throw new HttpException(404, { errors: { article: ['not found'] } });
+    throw new HttpException(404, { errors: { article: [] } });
   }
 
killedBy: ArticleService getArticle should throw 404 with exact error structure when article not found
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 7
+ Received  + 0

  Object {
    "errorCode": 404,
-   "message": Object {

[Killed] BlockStatement
app/routes/article/article.service.ts:276:56
   return articleMapper(article, id);
 };
 
-const disconnectArticlesTags = async (slug: string) => {
-  await prisma.article.update({
-    where: {
-      slug,
-    },
-    data: {
-      tagList: {
-        set: [],
-      },
-    },
-  });
-};
+const disconnectArticlesTags = async (slug: string) => {};
 
 export const updateArticle = async (article: any, slug: string, id: number) => {
killedBy: ArticleService updateArticle should call findFirst with slug for ownership check
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
app/routes/article/article.service.ts:278:12
 
 const disconnectArticlesTags = async (slug: string) => {
   await prisma.article.update({
-    where: {
-      slug,
-    },
+    where: {},
     data: {
       tagList: {
killedBy: ArticleService updateArticle should disconnect tags before updating (call update with tagList.set:[])
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "slug": "test-article-1",
- }

[Killed] ObjectLiteral
app/routes/article/article.service.ts:281:11
     where: {
       slug,
     },
-    data: {
-      tagList: {
-        set: [],
-      },
-    },
+    data: {},
   });
 };
killedBy: ArticleService updateArticle should disconnect tags before updating (call update with tagList.set:[])
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"set": []}
Received: undefined

[Killed] ObjectLiteral
app/routes/article/article.service.ts:293:12
   let newSlug = null;
 
   const existingArticle = await await prisma.article.findFirst({
-    where: {
-      slug,
-    },
+    where: {},
     select: {
       author: {
killedBy: ArticleService updateArticle should call findFirst with slug for ownership check
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "slug": "test-article-1",
- }

[Survived] BooleanLiteral
app/routes/article/article.service.ts:300:21
       author: {
         select: {
           id: true,
-          username: true,
+          username: false,
         },
       },

[Killed] ConditionalExpression
app/routes/article/article.service.ts:306:7
     },
   });
 
-  if (!existingArticle) {
+  if (true) {
     throw new HttpException(404, {});
   }
killedBy: ArticleService updateArticle should throw 403 with exact message when user is not the author
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 4
+ Received  + 1

  Object {
-   "errorCode": 403,
-   "message": Object {

[Killed] BooleanLiteral
app/routes/article/article.service.ts:306:7
     },
   });
 
-  if (!existingArticle) {
+  if (existingArticle) {
     throw new HttpException(404, {});
   }
killedBy: ArticleService updateArticle should throw 404 with status when article not found
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "errorCode": 404,
- }

[Killed] ConditionalExpression
app/routes/article/article.service.ts:310:7
     throw new HttpException(404, {});
   }
 
-  if (existingArticle.author.id !== id) {
+  if (true) {
     throw new HttpException(403, {
       message: 'You are not authorized to update this article',
killedBy: ArticleService updateArticle should throw 422 with exact error when slug is not unique
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 8
+ Received  + 1

  Object {
-   "errorCode": 422,
-   "message": Object {
