[Killed] EqualityOperator
app/routes/article/article.service.ts:310:7
     throw new HttpException(404, {});
   }
 
-  if (existingArticle.author.id !== id) {
+  if (existingArticle.author.id === id) {
     throw new HttpException(403, {
       message: 'You are not authorized to update this article',
killedBy: ArticleService updateArticle should throw 403 with exact message when user is not the author
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 4
+ Received  + 1

  Object {
-   "errorCode": 403,
-   "message": Object {

[Killed] ConditionalExpression
app/routes/article/article.service.ts:316:7
     });
   }
 
-  if (article.title) {
+  if (true) {
     newSlug = `${slugify(article.title)}-${id}`;
 
killedBy: ArticleService updateArticle should call findFirst with slug for ownership check
statusReason: Error: slugify: string argument expected

[Killed] BlockStatement
app/routes/article/article.service.ts:316:22
     });
   }
 
-  if (article.title) {
-    newSlug = `${slugify(article.title)}-${id}`;
-
-    if (newSlug !== slug) {
-      const existingTitle = await prisma.article.findFirst({
-        where: {
-          slug: newSlug,
-        },
-        select: {
-          slug: true,
-        },
-      });
-
-      if (existingTitle) {
-        throw new HttpException(422, { errors: { title: ['must be unique'] } });
-      }
-    }
-  }
+  if (article.title) {}
 
   const tagList =
killedBy: ArticleService updateArticle should throw 422 with exact error when slug is not unique
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] StringLiteral
app/routes/article/article.service.ts:317:15
   }
 
   if (article.title) {
-    newSlug = `${slugify(article.title)}-${id}`;
+    newSlug = ``;
 
     if (newSlug !== slug) {
killedBy: ArticleService updateArticle should include new slug in update data when title changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Brand-New-Title-1"
Received: undefined

[Killed] BlockStatement
app/routes/article/article.service.ts:319:27
   if (article.title) {
     newSlug = `${slugify(article.title)}-${id}`;
 
-    if (newSlug !== slug) {
-      const existingTitle = await prisma.article.findFirst({
-        where: {
-          slug: newSlug,
-        },
-        select: {
-          slug: true,
-        },
-      });
-
-      if (existingTitle) {
-        throw new HttpException(422, { errors: { title: ['must be unique'] } });
-      }
-    }
+    if (newSlug !== slug) {}
   }
 
killedBy: ArticleService updateArticle should throw 422 with exact error when slug is not unique
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] EqualityOperator
app/routes/article/article.service.ts:319:9
   if (article.title) {
     newSlug = `${slugify(article.title)}-${id}`;
 
-    if (newSlug !== slug) {
+    if (newSlug === slug) {
       const existingTitle = await prisma.article.findFirst({
         where: {
killedBy: ArticleService updateArticle should throw 422 with exact error when slug is not unique
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 10
+ Received  +  1

- Object {
-   "errorCode": 422,
-   "message": Object {

[Killed] ConditionalExpression
app/routes/article/article.service.ts:336:5
   }
 
   const tagList =
-    Array.isArray(article.tagList) && article.tagList.length
+    true
       ? article.tagList.map((tag: string) => ({
           create: { name: tag },
killedBy: ArticleService updateArticle should call findFirst with slug for ownership check
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
app/routes/article/article.service.ts:336:5
   }
 
   const tagList =
-    Array.isArray(article.tagList) && article.tagList.length
+    Array.isArray(article.tagList) || article.tagList.length
       ? article.tagList.map((tag: string) => ({
           create: { name: tag },
killedBy: ArticleService updateArticle should call findFirst with slug for ownership check
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
app/routes/article/article.service.ts:337:29
 
   const tagList =
     Array.isArray(article.tagList) && article.tagList.length
-      ? article.tagList.map((tag: string) => ({
-          create: { name: tag },
-          where: { name: tag },
-        }))
+      ? article.tagList.map(() => undefined)
       : [];
 
killedBy: ArticleService updateArticle should use connectOrCreate for tagList when updating with non-empty array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"create": {"name": "newtag"}, "where": {"name": "newtag"}}
Received: undefined

[Survived] ObjectLiteral
app/routes/article/article.service.ts:346:12
   await disconnectArticlesTags(slug);
 
   const updatedArticle = await prisma.article.update({
-    where: {
-      slug,
-    },
+    where: {},
     data: {
       ...(article.title ? { title: article.title } : {}),

[Killed] ObjectLiteral
app/routes/article/article.service.ts:351:26
     },
     data: {
       ...(article.title ? { title: article.title } : {}),
-      ...(article.body ? { body: article.body } : {}),
+      ...(article.body ? {} : {}),
       ...(article.description ? { description: article.description } : {}),
       ...(newSlug ? { slug: newSlug } : {}),
killedBy: ArticleService updateArticle should include body in update data when body is provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New body"
Received: undefined

[Killed] ObjectLiteral
app/routes/article/article.service.ts:359:14
         connectOrCreate: tagList,
       },
     },
-    include: {
-      tagList: {
-        select: {
-          name: true,
-        },
-      },
-      author: {
-        select: {
-          username: true,
-          bio: true,
-          image: true,
-          followedBy: true,
-        },
-      },
-      favoritedBy: true,
-      _count: {
-        select: {
-          favoritedBy: true,
-        },
-      },
-    },
+    include: {},
   });
 
killedBy: ArticleService updateArticle should use exact include structure for updateArticle main update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 21
+ Received  +  1

- Object {
-   "_count": Object {
-     "select": Object {

[Killed] ObjectLiteral
app/routes/article/article.service.ts:365:15
           name: true,
         },
       },
-      author: {
-        select: {
-          username: true,
-          bio: true,
-          image: true,
-          followedBy: true,
-        },
-      },
+      author: {},
       favoritedBy: true,
       _count: {
killedBy: ArticleService updateArticle should use exact include structure for updateArticle main update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

@@ -2,18 +2,11 @@
    "_count": Object {
      "select": Object {

[Killed] BlockStatement
app/routes/article/article.service.ts:400:25
     },
   });
 
-  if (!existingArticle) {
-    throw new HttpException(404, {});
-  }
+  if (!existingArticle) {}
 
   if (existingArticle.author.id !== id) {
killedBy: ArticleService deleteArticle should throw 404 with status when article not found
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "errorCode": 404,
- }

[Killed] ConditionalExpression
app/routes/article/article.service.ts:404:7
     throw new HttpException(404, {});
   }
 
-  if (existingArticle.author.id !== id) {
+  if (false) {
     throw new HttpException(403, {
       message: 'You are not authorized to delete this article',
killedBy: ArticleService deleteArticle should throw 403 if user is not the author
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ObjectLiteral
app/routes/article/article.service.ts:405:34
   }
 
   if (existingArticle.author.id !== id) {
-    throw new HttpException(403, {
-      message: 'You are not authorized to delete this article',
-    });
+    throw new HttpException(403, {});
   }
   await prisma.article.delete({
killedBy: ArticleService deleteArticle should throw 403 with exact message when user is not authorized to delete
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 0

  Object {
    "errorCode": 403,
-   "message": Object {

[Killed] StringLiteral
app/routes/article/article.service.ts:406:16
 
   if (existingArticle.author.id !== id) {
     throw new HttpException(403, {
-      message: 'You are not authorized to delete this article',
+      message: "",
     });
   }
killedBy: ArticleService deleteArticle should throw 403 with exact message when user is not authorized to delete
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 0

  Object {
    "errorCode": 403,
-   "message": Object {

[Killed] BooleanLiteral
app/routes/article/article.service.ts:421:13
 
   queries.push({
     author: {
-      demo: true,
+      demo: false,
     },
   });
killedBy: ArticleService getCommentsByArticle should include demo:true in comments OR query
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"author": {"demo": true}}
Received array: [{"author": {"demo": false}}]

[Killed] BlockStatement
app/routes/article/article.service.ts:425:11
     },
   });
 
-  if (id) {
-    queries.push({
-      author: {
-        id,
-      },
-    });
-  }
+  if (id) {}
 
   const comments = await prisma.article.findUnique({
killedBy: ArticleService getCommentsByArticle should include user id in comments OR query when id provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"author": {"id": 5}}
Received array: [{"author": {"demo": true}}]

[Killed] ObjectLiteral
app/routes/article/article.service.ts:427:15
 
   if (id) {
     queries.push({
-      author: {
-        id,
-      },
+      author: {},
     });
   }
killedBy: ArticleService getCommentsByArticle should include user id in comments OR query when id provided
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"author": {"id": 5}}
Received array: [{"author": {"demo": true}}, {"author": {}}]

[Survived] BooleanLiteral
app/routes/article/article.service.ts:443:15
           OR: queries,
         },
         select: {
-          id: true,
+          id: false,
           createdAt: true,
           updatedAt: true,

[Survived] BooleanLiteral
app/routes/article/article.service.ts:444:22
         },
         select: {
           id: true,
-          createdAt: true,
+          createdAt: false,
           updatedAt: true,
           body: true,

[Survived] BooleanLiteral
app/routes/article/article.service.ts:445:22
         select: {
           id: true,
           createdAt: true,
-          updatedAt: true,
+          updatedAt: false,
           body: true,
           author: {

[Survived] BooleanLiteral
app/routes/article/article.service.ts:446:17
           id: true,
           createdAt: true,
           updatedAt: true,
-          body: true,
+          body: false,
           author: {
             select: {

[Killed] ArrowFunction
app/routes/article/article.service.ts:460:41
     },
   });
 
-  const result = comments?.comments.map((comment: any) => ({
-    ...comment,
-    author: {
-      username: comment.author.username,
-      bio: comment.author.bio,
-      image: comment.author.image,
-      following: comment.author.followedBy.some((follow: any) => follow.id === id),
-    },
-  }));
+  const result = comments?.comments.map(() => undefined);
 
   return result;
killedBy: ArticleService getCommentsByArticle should return comments without id (following:false)
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] OptionalChaining
app/routes/article/article.service.ts:460:18
     },
   });
 
-  const result = comments?.comments.map((comment: any) => ({
+  const result = comments.comments.map((comment: any) => ({
     ...comment,
     author: {
killedBy: ArticleService getCommentsByArticle should return undefined when article not found
statusReason: TypeError: Cannot read properties of null (reading 'comments')

[Killed] ArrowFunction
app/routes/article/article.service.ts:466:49
       username: comment.author.username,
       bio: comment.author.bio,
       image: comment.author.image,
-      following: comment.author.followedBy.some((follow: any) => follow.id === id),
+      following: comment.author.followedBy.some(() => undefined),
     },
   }));
killedBy: ArticleService getCommentsByArticle should return following:true when user id is in comment author followedBy
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "following"

Expected value: true
Received value: false

[Killed] ConditionalExpression
app/routes/article/article.service.ts:466:66
       username: comment.author.username,
       bio: comment.author.bio,
       image: comment.author.image,
-      following: comment.author.followedBy.some((follow: any) => follow.id === id),
+      following: comment.author.followedBy.some((follow: any) => false),
     },
   }));
killedBy: ArticleService getCommentsByArticle should return following:true when user id is in comment author followedBy
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "following"

Expected value: true
Received value: false

[Killed] BooleanLiteral
app/routes/article/article.service.ts:474:7
 };
 
 export const addComment = async (body: string, slug: string, id: number) => {
-  if (!body) {
+  if (body) {
     throw new HttpException(422, { errors: { body: ["can't be blank"] } });
   }
killedBy: ArticleService addComment should add a comment and return it with following:true
statusReason: Error: [object Object]

[Killed] ConditionalExpression
app/routes/article/article.service.ts:474:7
 };
 
 export const addComment = async (body: string, slug: string, id: number) => {
-  if (!body) {
+  if (false) {
     throw new HttpException(422, { errors: { body: ["can't be blank"] } });
   }
killedBy: ArticleService addComment should throw with body error when body is empty
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ObjectLiteral
app/routes/article/article.service.ts:475:44
 
 export const addComment = async (body: string, slug: string, id: number) => {
   if (!body) {
-    throw new HttpException(422, { errors: { body: ["can't be blank"] } });
+    throw new HttpException(422, { errors: {} });
   }
 
killedBy: ArticleService addComment should throw with body error when body is empty
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] StringLiteral
app/routes/article/article.service.ts:475:53
 
 export const addComment = async (body: string, slug: string, id: number) => {
   if (!body) {
-    throw new HttpException(422, { errors: { body: ["can't be blank"] } });
+    throw new HttpException(422, { errors: { body: [""] } });
   }
 
killedBy: ArticleService addComment should throw with body error when body is empty
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 9
+ Received  + 1

- Object {
-   "message": Object {
-     "errors": Object {

[Killed] ObjectLiteral
app/routes/article/article.service.ts:495:15
           id: article.id,
         },
       },
-      author: {
-        connect: {
-          id: id,
-        },
-      },
+      author: {},
     },
     include: {
killedBy: ArticleService addComment should call comment.create with body, article id connect, and author id connect
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "connect": Object {
-     "id": 5,

[Killed] ObjectLiteral
app/routes/article/article.service.ts:518:13
     createdAt: comment.createdAt,
     updatedAt: comment.updatedAt,
     body: comment.body,
-    author: {
-      username: comment.author.username,
-      bio: comment.author.bio,
-      image: comment.author.image,
-      following: comment.author.followedBy.some((follow: any) => follow.id === id),
-    },
+    author: {},
   };
 };
killedBy: ArticleService addComment should add a comment and return it with following:true
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "following"
Received path: []

Expected value: true
Received value: {}

[Killed] ObjectLiteral
app/routes/article/article.service.ts:529:12
 
 export const deleteComment = async (id: number, userId: number) => {
   const comment = await prisma.comment.findFirst({
-    where: {
-      id,
-      author: {
-        id: userId,
-      },
-    },
+    where: {},
     select: {
       author: {
killedBy: ArticleService deleteComment should call comment.findFirst with id and author.id:userId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: undefined

[Survived] ObjectLiteral
app/routes/article/article.service.ts:536:15
       },
     },
     select: {
-      author: {
-        select: {
-          id: true,
-          username: true,
-        },
-      },
+      author: {},
     },
   });

[Killed] BooleanLiteral
app/routes/article/article.service.ts:545:7
     },
   });
 
-  if (!comment) {
+  if (comment) {
     throw new HttpException(404, {});
   }
killedBy: ArticleService deleteComment should delete comment successfully
statusReason: Error: expect(received).resolves.not.toThrow()

Received promise rejected instead of resolved
Rejected to value: [Error: [object Object]]

[Killed] ConditionalExpression
app/routes/article/article.service.ts:545:7
     },
   });
 
-  if (!comment) {
+  if (true) {
     throw new HttpException(404, {});
   }
killedBy: ArticleService deleteComment should delete comment successfully
statusReason: Error: expect(received).resolves.not.toThrow()

Received promise rejected instead of resolved
Rejected to value: [Error: [object Object]]

[Killed] ConditionalExpression
app/routes/article/article.service.ts:549:7
     throw new HttpException(404, {});
   }
 
-  if (comment.author.id !== userId) {
+  if (true) {
     throw new HttpException(403, {
       message: 'You are not authorized to delete this comment',
killedBy: ArticleService deleteComment should delete comment successfully
statusReason: Error: expect(received).resolves.not.toThrow()

Received promise rejected instead of resolved
Rejected to value: [Error: [object Object]]

[Killed] BlockStatement
app/routes/article/article.service.ts:549:37
     throw new HttpException(404, {});
   }
 
-  if (comment.author.id !== userId) {
-    throw new HttpException(403, {
-      message: 'You are not authorized to delete this comment',
-    });
-  }
+  if (comment.author.id !== userId) {}
 
   await prisma.comment.delete({
killedBy: ArticleService deleteComment should throw 403 when comment author id differs from userId
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ObjectLiteral
app/routes/article/article.service.ts:567:11
     where: {
       slug: slugPayload,
     },
-    data: {
-      favoritedBy: {
-        connect: {
-          id: id,
-        },
-      },
-    },
+    data: {},
     include: {
       tagList: {
killedBy: ArticleService favoriteArticle should call update with connect (NOT disconnect)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"connect": {"id": 123}}
Received: undefined

[Killed] ArrowFunction
app/routes/article/article.service.ts:600:34
   const result = {
     ...article,
     author: profileMapper(article.author, id),
-    tagList: article.tagList.map((tag: Tag) => tag.name),
+    tagList: article.tagList.map(() => undefined),
     favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
     favoritesCount: _count.favoritedBy,
killedBy: ArticleService favoriteArticle should return tagList as array of strings
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "dragons",
+   undefined,

[Killed] EqualityOperator
app/routes/article/article.service.ts:601:61
     ...article,
     author: profileMapper(article.author, id),
     tagList: article.tagList.map((tag: Tag) => tag.name),
-    favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
+    favorited: article.favoritedBy.some((favorited: any) => favorited.id !== id),
     favoritesCount: _count.favoritedBy,
   };
killedBy: ArticleService favoriteArticle should return favorited:true when user id is in favoritedBy
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "favorited"

Expected value: true
Received value: false

[Killed] ConditionalExpression
app/routes/article/article.service.ts:601:61
     ...article,
     author: profileMapper(article.author, id),
     tagList: article.tagList.map((tag: Tag) => tag.name),
-    favorited: article.favoritedBy.some((favorited: any) => favorited.id === id),
+    favorited: article.favoritedBy.some((favorited: any) => true),
     favoritesCount: _count.favoritedBy,
   };
killedBy: ArticleService favoriteArticle should return favorited:false when user id is NOT in favoritedBy
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "favorited"

Expected value: false
Received value: true

[Killed] ObjectLiteral
app/routes/article/article.service.ts:610:12
 
 export const unfavoriteArticle = async (slugPayload: string, id: number) => {
   const { _count, ...article } = await prisma.article.update({
-    where: {
-      slug: slugPayload,
-    },
+    where: {},
     data: {
       favoritedBy: {
killedBy: ArticleService unfavoriteArticle should call update with correct slug in where
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "slug": "my-slug",
- }

[Killed] ObjectLiteral
app/routes/article/article.service.ts:613:11
     where: {
       slug: slugPayload,
     },
-    data: {
-      favoritedBy: {
-        disconnect: {
-          id: id,
-        },
-      },
-    },
+    data: {},
     include: {
       tagList: {
killedBy: ArticleService unfavoriteArticle should call update with disconnect (NOT connect)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"disconnect": {"id": 123}}
Received: undefined

[Killed] ObjectLiteral
app/routes/article/article.service.ts:615:21
     },
     data: {
       favoritedBy: {
-        disconnect: {
-          id: id,
-        },
+        disconnect: {},
       },
     },
killedBy: ArticleService unfavoriteArticle should call update with disconnect (NOT connect)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
-   "disconnect": Object {
-     "id": 123,
