[Killed] ConditionalExpression
app/routes/article/author.mapper.ts:8:64
   bio: author.bio,
   image: author.image,
   following: id
-    ? author.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? author.followedBy.some((followingUser: Partial<User>) => false)
     : false,
 });
killedBy: authorMapper should return following: true when user follows the author
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
app/routes/article/author.mapper.ts:8:64
   bio: author.bio,
   image: author.image,
   following: id
-    ? author.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
+    ? author.followedBy.some((followingUser: Partial<User>) => true)
     : false,
 });
killedBy: authorMapper should return following: false when user does NOT follow the author
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
app/routes/article/author.mapper.ts:9:7
   image: author.image,
   following: id
     ? author.followedBy.some((followingUser: Partial<User>) => followingUser.id === id)
-    : false,
+    : true,
 });
 
killedBy: authorMapper should return following: false when no id is provided (undefined)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
