[Killed] BlockStatement
app/routes/profile/profile.service.ts:5:75
 import profileMapper from './profile.utils';
 import HttpException from '../../models/http-exception.model';
 
-export const getProfile = async (usernamePayload: string, id?: number) => {
-  const profile = await prisma.user.findUnique({
-    where: {
-      username: usernamePayload,
-    },
-    include: {
-      followedBy: true,
-    },
-  });
-
-  if (!profile) {
-    throw new HttpException(404, {});
-  }
-
-  return profileMapper(profile, id);
-};
+export const getProfile = async (usernamePayload: string, id?: number) => {};
 
 export const followUser = async (usernamePayload: string, id: number) => {
killedBy: ProfileService getProfile should return following:false when viewer is NOT in followedBy
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BooleanLiteral
app/routes/profile/profile.service.ts:11:19
       username: usernamePayload,
     },
     include: {
-      followedBy: true,
+      followedBy: false,
     },
   });
killedBy: ProfileService getProfile should call findUnique with correct username and include followedBy:true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "include": Object {
-     "followedBy": true,

[Killed] ConditionalExpression
app/routes/profile/profile.service.ts:15:7
     },
   });
 
-  if (!profile) {
+  if (true) {
     throw new HttpException(404, {});
   }
killedBy: ProfileService getProfile should return following:false when viewer is NOT in followedBy
statusReason: Error: [object Object]

[Killed] BlockStatement
app/routes/profile/profile.service.ts:22:74
   return profileMapper(profile, id);
 };
 
-export const followUser = async (usernamePayload: string, id: number) => {
-  const profile = await prisma.user.update({
-    where: {
-      username: usernamePayload,
-    },
-    data: {
-      followedBy: {
-        connect: {
-          id,
-        },
-      },
-    },
-    include: {
-      followedBy: true,
-    },
-  });
-
-  return profileMapper(profile, id);
-};
+export const followUser = async (usernamePayload: string, id: number) => {};
 
 export const unfollowUser = async (usernamePayload: string, id: number) => {
killedBy: ProfileService followUser should return following:true after following (viewer in followedBy)
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
app/routes/profile/profile.service.ts:34:14
         },
       },
     },
-    include: {
-      followedBy: true,
-    },
+    include: {},
   });
 
killedBy: ProfileService followUser should call update with connect (NOT disconnect)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,12 +4,10 @@
        "connect": Object {
          "id": 123,

[Killed] BlockStatement
app/routes/profile/profile.service.ts:42:76
   return profileMapper(profile, id);
 };
 
-export const unfollowUser = async (usernamePayload: string, id: number) => {
-  const profile = await prisma.user.update({
-    where: {
-      username: usernamePayload,
-    },
-    data: {
-      followedBy: {
-        disconnect: {
-          id,
-        },
-      },
-    },
-    include: {
-      followedBy: true,
-    },
-  });
-
-  return profileMapper(profile, id);
-};
+export const unfollowUser = async (usernamePayload: string, id: number) => {};
 
killedBy: ProfileService unfollowUser should return following:false after unfollowing
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
app/routes/profile/profile.service.ts:49:21
     },
     data: {
       followedBy: {
-        disconnect: {
-          id,
-        },
+        disconnect: {},
       },
     },
killedBy: ProfileService unfollowUser should call update with disconnect (NOT connect)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,9 @@
  Object {
    "data": Object {
