[Killed] BooleanLiteral
app/routes/tag/tag.service.ts:6:24
 
 const getTags = async (id?: number): Promise<string[]> => {
   const queries = [];
-  queries.push({ demo: true });
+  queries.push({ demo: false });
 
   if (id) {
killedBy: TagService getTags should call findMany with demo:true in OR query when no id provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
-     "demo": true,

[Killed] BlockStatement
app/routes/tag/tag.service.ts:8:11
   const queries = [];
   queries.push({ demo: true });
 
-  if (id) {
-    queries.push({
-      id: {
-        equals: id,
-      },
-    });
-  }
+  if (id) {}
 
   const tags = await prisma.tag.findMany({
killedBy: TagService getTags should call findMany with both demo:true AND id in OR query when id is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 0

  Array [
    Object {
      "demo": true,

[Killed] ObjectLiteral
app/routes/tag/tag.service.ts:30:17
       name: true,
     },
     orderBy: {
-      articles: {
-        _count: 'desc',
-      },
+      articles: {},
     },
     take: 10,
killedBy: TagService getTags should order results by article count descending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
-   "articles": Object {
-     "_count": "desc",

[Killed] ArrowFunction
app/routes/tag/tag.service.ts:37:19
     take: 10,
   });
 
-  return tags.map((tag: Tag) => tag.name);
+  return tags.map(() => undefined);
 };
 
killedBy: TagService getTags should return a list of tag names without id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   "dragons",
-   "training",
